import { Form } from 'react-bootstrap'

export default function SelectSpeciality(props) {
    return (
        <Form.Group className="mb-2" controlId="formBasicEmail">
            <Form.Label className="label">Специалност</Form.Label>
            <Form.Select name="speciality">
                <option value="00 Общопрактикуващ лекар">00 Общопрактикуващ лекар</option>
                <option value="01 Акушерство и гинекология">01 Акушерство и гинекология</option>
                <option value="02 Клинична алергология">02 Клинична алергология</option>
                <option value="03 Гастроентерология">03 Гастроентерология</option>
                <option value="04 Кожни и венерически болести">04 Кожни и венерически болести</option>
                <option value="05 Ендокринология и болести на обмяната">05 Ендокринология и болести на обмяната</option>
                <option value="06 Вътрешни болести">06 Вътрешни болести</option>
                <option value="07 Инфекциозни болести">07 Инфекциозни болести</option>
                <option value="08 Кардиология">08 Кардиология</option>
                <option value="09 Клинична лаборатория">09 Клинична лаборатория</option>
                <option value="10 Нервни болести">10 Нервни болести</option>
                <option value="11 Нефрология">11 Нефрология</option>
                <option value="12 Медицинска онкология">12 Медицинска онкология</option>
                <option value="13 Ортопедия и травматология">13 Ортопедия и травматология</option>
                <option value="14 Ушно-носно-гърлени болести">14 Ушно-носно-гърлени болести</option>
                <option value="15 Очни болести">15 Очни болести</option>
                <option value="16 Медицинска паразитология">16 Медицинска паразитология</option>
                <option value="17 Педиатрия">17 Педиатрия</option>
                <option value="18 Психиатрия">18 Психиатрия</option>
                <option value="19 Пневмология и фтизиатрия">19 Пневмология и фтизиатрия</option>
                <option value="20 Ревматология">20 Ревматология</option>
                <option value="21 Образна диагностика">21 Образна диагностика</option>
                <option value="22 Урология">22 Урология</option>
                <option value="23 Физикална и рехабилитационна медицина">23 Физикална и рехабилитационна медицина</option>
                <option value="24 Клинична хематология">24 Клинична хематология</option>
                <option value="25 Хирургия">25 Хирургия</option>
                <option value="26 Анестезиология и интензивно лечение">26 Анестезиология и интензивно лечение</option>
                <option value="27 Гръдна хирургия">27 Гръдна хирургия</option>
                <option value="29 Неврохирургия">29 Неврохирургия</option>
                <option value="31 Съдова хирургия">31 Съдова хирургия</option>
                <option value="32 Кардиохирурия">32 Кардиохирурия</option>
                <option value="33 Клинична алергология и педиатрия">33 Клинична алергология и педиатрия</option>
                <option value="34 Детска ендокринология и болести на обмяната">34 Детска ендокринология и болести на обмяната</option>
                <option value="35 Детска кардиология">35 Детска кардиология</option>
                <option value="36 Детска пневмология и фтизиатрия">36 Детска пневмология и фтизиатрия</option>
                <option value="37 Клинична токсикология">37 Клинична токсикология</option>
                <option value="38 Детска психиатрия">38 Детска психиатрия</option>
                <option value="39 Детска ревматология">39 Детска ревматология</option>
                <option value="40 Трансфузионна хематология">40 Трансфузионна хематология</option>
                <option value="41 Микробиология">41 Микробиология</option>
                <option value="43 Обща и клинична патология">43 Обща и клинична патология</option>
                <option value="44 Вирусология">44 Вирусология</option>
                <option value="45 Клинична имунология">45 Клинична имунология</option>
                <option value="48 Нуклеарна медицина">48 Нуклеарна медицина</option>
                <option value="50 Детска хирургия">50 Детска хирургия</option>
                <option value="51 Детска клинична хематология и онкология">51 Детска клинична хематология и онкология</option>
                <option value="52 Детска гастроентерология">52 Детска гастроентерология</option>
                <option value="53 Детска нефрология и хемодиализа">53 Детска нефрология и хемодиализа</option>
                <option value="54 Детска неврология">54 Детска неврология</option>
                <option value="55 Лицево-челюстна хирургия">55 Лицево-челюстна хирургия</option>
                <option value="56 Неонатология">56 Неонатология</option>
                <option value="57 Пластично-възстановителна и естетична хирургия">57 Пластично-възстановителна и естетична хирургия</option>
                <option value="59 Медицинска генетика">59 Медицинска генетика</option>
                <option value="62 Орална хирургия">62 Орална хирургия</option>
                <option value="69 Лъчелечение">69 Лъчелечение</option>
                <option value="70 Хранене и диететика">70 Хранене и диететика</option>
                <option value="73 Ангиология">73 Ангиология</option>
                <option value="74 Професионални болести">74 Професионални болести</option>
            </Form.Select>
        </Form.Group>
    )
}